class EmbedColor:
    RED = 0xFF213F
    BLUE = 0x0390FC
    GREEN = 0x88FF61
    GOLD = 0xFFE524
    BLURPLE = 0x5865F2
    EMBED = 0x2C2D31
    LIME = 0x95FF00
    YELLOW = 0xFFFF00




class trackss : # 이런 뻘짓을 왜 한건가
    TRACKK = [
    # 포레스트 (Forest)
    "포레스트 통나무",
    "포레스트 기암괴석",
    "포레스트 지그재그",
    "포레스트 통곡의 절벽",
    "포레스트 아슬아슬 점프",

    # 사막 (Desert)
    "사막 빙글빙글 공사장",
    "사막 피라미드 탐험",
    "사막 놀라운 공룡 유적지",
    "[R] 사막 빙글빙글 공사장",

    # 빌리지 (Village)
    "빌리지 고가의 질주",
    "빌리지 손가락",
    "빌리지 남산",
    "빌리지 시계탑",
    "빌리지 운하",
    "빌리지 손가락 2",
    "빌리지 붐힐터널",
    "빌리지 운명의 다리",

    # 아이스 (Ice)
    "아이스 신나는 하프파이프",
    "아이스 갈라진 빙산",
    "아이스 부서진 빙산",
    "아이스 설산 다운힐",
    "아이스 익스트림 경기장",
    "아이스[오리지널] 버려진 연습장",

    # 공동묘지 (Tomb)
    "공동묘지 공포의 외길",
    "공동묘지 마왕의 초대",

    # 광산 (Mine)
    "광산 꼬불꼬불 다운힐",
    "광산 아슬아슬 궤도전차",
    "광산 위험한 제련소",

    # 노르테유 (Northeu)
    "노르테유 익스프레스",
    "노르테유 전투비행장",
    "노르테유 허공의 갈림길",
    "노르테유 붕붕 점프",

    # 팩토리 (Factory)
    "팩토리 미완성 5구역",
    "팩토리 부비트랩 공장 탐험",
    "팩토리 두개의 공장",
    "팩토리 브로디 비밀의 연구소",

    # 해적 (Pirate)
    "해적 로비 절벽의 전투",
    "해적 숨겨진 보물",
    "해적 가파른 감시탑",

    # 문힐시티 (Moonhill)
    "문힐시티 숨겨진 지하터널",

    # 황금문명 (Gold)
    "황금문명 오르에트 황금 좌표",

    # 차이나 (China)
    "차이나 서안 병마용",
    "차이나 무당산 다운힐",
    "차이나 골목길 대질주",

    # 대저택 (Mansion)
    "대저택 루이의 장난감 천국",
    "대저택 은밀한 지하실",
    "대저택 루이의 숨겨진 비밀 방",
    "대저택 럭셔리 거대욕조",
    "대저택 루이의 서재",

    # WKC
    "WKC 투어링 랠리",
    "WKC 상해 서킷",
    "WKC 강남 서킷",
    "WKC 코리아 서킷",
    "WKC[오리지널] F1 서킷",
    "WKC[오리지널] 컴포트 레이스",
    "WKC[오리지널] 트럼펫",
    "WKC[오리지널] 익스트림 레이싱",
    "WKC[오리지널] 미완성 서킷",
    "WKC[오리지널] 서울 시가지 서킷",
    "WKC[오리지널] 인제 스피디움",

    # 비치 (Beach)
    "비치 신나는 여름휴가",
    "비치 해변 드라이브",
    "비치 트랙 9",

    # 월드 (World)
    "월드 리오 다운힐",
    "월드 두바이 다운타운",
    "월드 파리 에펠탑 다이브",

    # 네모 (Nemo)
    "네모 산타의 비밀공간",
    "네모 장난감 선물공장",
    "네모 강철바위 용광로",

    # 도검 (Sword)
    "도검 구름의 협곡",

    # 어비스 (Abyss)
    "어비스 스카이라인",
    "어비스 숨겨진 바닷길"
    
    # 코리아 (Korea)
    "코리아 제주 해오름 다운힐",
    "코리아 부산의 밤",
    "코리아[오리지널] 홍대 새벽녘 질주",
    "코리아[오리지널] 울릉도 고갯길",

    # 메이플 (Maple)
    "메이플 레헬른 악몽의 시계탑",
    "메이플 헤네시스 공원",

    # 마인크래프트 (Minecraft)
    "마인크래프트 모험의 시간",
    "마인크래프트 엔드 시티 탐험",
    "마인크래프트 잊혀진 정글",
    "마인크래프트 다이아몬드다!",

    # 카우지 (Kauzee)
    "카우지 디스트릭트 13",

    # 마리오카트 (Mario Kart)
    "마리오카트 무지개 로드 GC",
    "마리오카트 무지개 로드 64",
    "마리오카트 와루이지 핀볼",
    "마리오카트 몬테 타운",
    "마리오카트 스노우랜드",

    # 서드파티 (Third Party)
    "서드파티 시티 이스케이프",
    "서드파티 황금의 순간",
    "서드파티 마키나 다운힐"
]
